## pandas part 2

In [1]:
import  pandas as pd
# five functions of pandas
#1. 
df = pd.read_csv("titanic.csv")
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [2]:
#2.
df.iloc[1:5, [1, 2, 3]]

   Survived  Pclass                                               Name
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0       3                           Allen, Mr. William Henry

In [3]:
#3.
df.loc[1:5, ["Survived", "Pclass", "Name"]]

   Survived  Pclass                                               Name
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0       3                           Allen, Mr. William Henry
5         0       3                                   Moran, Mr. James

In [4]:
#4.
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
#5.
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
#6.
pd.Categorical(df["Pclass"])

[3, 1, 3, 1, 3, ..., 2, 1, 3, 1, 3]
Length: 891
Categories (3, int64): [1, 2, 3]

In [7]:
#2.
#let the dataframe be df1 with columns name A, B and C
idx = [1,2,3] 
df1 = pd.DataFrame({'A': [11, 21, 31],
                   'B': [12, 22, 32],
                   'C': [13, 23, 33]}, index = idx)

df1

    A   B   C
1  11  12  13
2  21  22  23
3  31  32  33

In [8]:
idx1 = [1, 3,5]
df2 = df1.reindex(idx1)
df2
#df2 is the new required dataframe

      A     B     C
1  11.0  12.0  13.0
3  31.0  32.0  33.0
5   NaN   NaN   NaN

In [9]:
df2.head(2).sum()

A    42.0
B    44.0
C    46.0
dtype: float64

In [10]:
#Q.3
df3 = pd.DataFrame({'A': [11, 21, 31, 15],
                   'B': [12, 22, 32, 75],
                   'C': [13, 23, 33, 23],
                   'Values':[9,2,5,8]})
df3

    A   B   C  Values
0  11  12  13       9
1  21  22  23       2
2  31  32  33       5
3  15  75  23       8

In [11]:
df3['Values'].head(3).sum()

16

In [12]:
df4 = pd.DataFrame({'A': [11, 21, 31, 15],
                   'B': [12, 22, 32, 75],
                    'Text': ['abc', 'abcdfreg', '', 'text']})
df4


newCol = []
for i in df4['Text']:
    x = len(i)
    newCol.append(x)

df4['Word_Count'] = newCol

In [13]:
df4

    A   B      Text  Word_Count
0  11  12       abc           3
1  21  22  abcdfreg           8
2  31  32                     0
3  15  75      text           4

In [14]:
#Q.5
# df is titanic.csv file
# size() returns no. of elements, rows X columns
# shape()returns tuple of no. of rows and columns
size1 = df.size
size1

10692

In [15]:
size2 = df.shape
size2

(891, 12)

# Q.6

# syntax:
   pd.read_excel("file name")

In [16]:
#Q.7
df7 = pd.DataFrame({'A': [11, 21, 31, 15],
                   'B': [12, 22, 32, 75],
                   'email': ['abc@hotmail.com', 'dfreg.xyz@gmail.com', 'a.b.c@gmail.com', 'text@outlook.com']})

'''
username = []

for i in df7['email']:
   
    for j in i:
        
        if j != '@':
            temp.append()
        else:
            break
    username.append(temp)        
'''
x = df7['email'].str.split('@').str[0]            

username = []

for i in x:
    username.append(i)
    
username

['abc', 'dfreg.xyz', 'a.b.c', 'text']

In [17]:
df7['Username'] = username
df7

    A   B                email   Username
0  11  12      abc@hotmail.com        abc
1  21  22  dfreg.xyz@gmail.com  dfreg.xyz
2  31  32      a.b.c@gmail.com      a.b.c
3  15  75     text@outlook.com       text

In [18]:
#Q8
idx = [0,1,2,3,4]
df8 = pd.DataFrame({'A': [3, 8, 6, 2, 9],
                   'B': [5, 2, 9, 3, 1],
                   'C': [1, 7, 4, 5, 2]}, index = idx)

df8

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [19]:
# A> 5
# B< 10
resA = []
for i in df8['A']:
    if i>5:
        resA.append(i)
resA

[8, 6, 9]

In [20]:
#Q.8
result = df8[(df8['A'] > 5) & (df8['B']< 10)]
result
# result is the required dataframe

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [21]:
#q.9
df3 = pd.DataFrame({'A': [11, 21, 31, 15],
                   'B': [12, 22, 32, 75],
                   'C': [13, 23, 33, 23],
                   'Values':[9,2,5,8]})
new = df3.describe()
type(new)
new

               A          B          C    Values
count   4.000000   4.000000   4.000000  4.000000
mean   19.500000  35.250000  23.000000  6.000000
std     8.698659  27.729347   8.164966  3.162278
min    11.000000  12.000000  13.000000  2.000000
25%    14.000000  19.500000  20.500000  4.250000
50%    18.000000  27.000000  23.000000  6.500000
75%    23.500000  42.750000  25.500000  8.250000
max    31.000000  75.000000  33.000000  9.000000

In [24]:
new = pd.DataFrame(df3.mean())
#print(new['Values'])
new.loc['Values']

0    6.0
Name: Values, dtype: float64

In [25]:
new = pd.DataFrame(df3.std())
#print(new['Values'])
new.loc['Values']

0    3.162278
Name: Values, dtype: float64